-- Аксиома выбора

-- Формулировка аксиомы.
-- P.Martin-Lof, An intuitionistic type theory-Bibliopolis (1984), p.50.
def AC : Prop := {A B : Type} → {C : A → B → Prop}
  → (∀ (x : A), ∃ y : B, C x y)                  -- непустота множеств
  → ∃ f : (A → B), ∀ (x : A), C x (f x)

-- Доказательство AC тривиально.
theorem prf : AC := λ g => ⟨ λ z => (g z).choose, λ z => (g z).choose_spec ⟩


-- Классическая формулировка не доказывается в интуиционизме из-за
-- двойного отрицания.

def ACC : Prop := {A B : Type} → {C : A → B → Prop}
    → (∀ (x : A), ¬ ¬ (∃ y : B, C x y))          -- непустота множеств
    → ¬ ¬ (∃ f : (A → B), ∀ (x : A), C x (f x))

-- Если вы знаете, что тип непуст, то это не значит, что вы знаете хотя бы
-- один элемент этого типа.
